In [1]:
# %%
import pandas as pd

df = pd.read_csv("tips.csv")
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [2]:

# %%
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    object
 3   smoker      244 non-null    object
 4   day         244 non-null    object
 5   time        244 non-null    object
 6   size        244 non-null    int64
dtypes: float64(2), int64(1), object(4)
memory usage: 13.5+ KB

In [3]:

# %%
df.describe()

       total_bill         tip        size
count  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672
std      8.902412    1.383638    0.951100
min      3.070000    1.000000    1.000000
25%     13.347500    2.000000    2.000000
50%     17.795000    2.900000    2.000000
75%     24.127500    3.562500    3.000000
max     50.810000   10.000000    6.000000

In [4]:

# %%
df.columns

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size'], dtype='object')

In [5]:

# %%
df.shape

(244, 7)

In [6]:

# %%
df["total_bill"]
df[["total_bill", "tip"]]

     total_bill   tip
0         16.99  1.01
1         10.34  1.66
2         21.01  3.50
3         23.68  3.31
4         24.59  3.61
..          ...   ...
239       29.03  5.92
240       27.18  2.00
241       22.67  2.00
242       17.82  1.75
243       18.78  3.00

[244 rows x 2 columns]

In [7]:

# %%
df[df["total_bill"] > 30]
df[df["sex"] == "Female"]
df[(df["total_bill"] > 20) & (df["time"] == "Dinner")]

     total_bill   tip     sex smoker  day    time  size
2         21.01  3.50    Male     No  Sun  Dinner     3
3         23.68  3.31    Male     No  Sun  Dinner     2
4         24.59  3.61  Female     No  Sun  Dinner     4
5         25.29  4.71    Male     No  Sun  Dinner     4
7         26.88  3.12    Male     No  Sun  Dinner     4
..          ...   ...     ...    ...  ...     ...   ...
237       32.83  1.17    Male    Yes  Sat  Dinner     2
238       35.83  4.67  Female     No  Sat  Dinner     3
239       29.03  5.92    Male     No  Sat  Dinner     3
240       27.18  2.00  Female    Yes  Sat  Dinner     2
241       22.67  2.00    Male    Yes  Sat  Dinner     2

[81 rows x 7 columns]

In [8]:

# %%
df[(df["total_bill"] > 40) & (df["size"] == 3)].sort_values("total_bill", ascending=False)

     total_bill   tip     sex smoker  day    time  size
170       50.81  10.0    Male    Yes  Sat  Dinner     3
182       45.35   3.5    Male    Yes  Sun  Dinner     3
102       44.30   2.5  Female    Yes  Sat  Dinner     3

In [9]:



# %%
df[(df["total_bill"] > 40) & (df["size"] == 3)]["tip"].mean()

np.float64(5.333333333333333)

In [10]:

# %%
df["tip_pct"] = df["tip"] / df["total_bill"] * 100

df[(df["total_bill"] > 40) & (df["size"] == 3)].sort_values("tip_pct", ascending=False)

     total_bill   tip     sex smoker  day    time  size    tip_pct
170       50.81  10.0    Male    Yes  Sat  Dinner     3  19.681165
182       45.35   3.5    Male    Yes  Sun  Dinner     3   7.717751
102       44.30   2.5  Female    Yes  Sat  Dinner     3   5.643341

In [11]:


# %%
df.groupby("sex")["tip"].mean()

sex
Female    2.833448
Male      3.089618
Name: tip, dtype: float64

In [12]:


# %%
df.groupby("day")["total_bill"].mean()

day
Fri     17.151579
Sat     20.441379
Sun     21.410000
Thur    17.682742
Name: total_bill, dtype: float64

In [13]:


# %%
df.groupby("time")[["total_bill", "tip"]].agg(["mean", "sum"])

       total_bill                tip
             mean      sum      mean     sum
time
Dinner  20.797159  3660.30  3.102670  546.07
Lunch   17.168676  1167.47  2.728088  185.51

In [14]:

# %%
df.groupby(["day", "sex"])["tip"].mean()

day   sex
Fri   Female    2.781111
      Male      2.693000
Sat   Female    2.801786
      Male      3.083898
Sun   Female    3.367222
      Male      3.220345
Thur  Female    2.575625
      Male      2.980333
Name: tip, dtype: float64

In [15]:


# %%
df.groupby("day")["tip"].mean()

day
Fri     2.734737
Sat     2.993103
Sun     3.255132
Thur    2.771452
Name: tip, dtype: float64

In [16]:

# %%
df.groupby("time")["tip"].mean()

time
Dinner    3.102670
Lunch     2.728088
Name: tip, dtype: float64

In [17]:

# %%
df.groupby("time")["tip"].mean().sort_values(ascending=False)

time
Dinner    3.102670
Lunch     2.728088
Name: tip, dtype: float64

In [18]:

# %%
df.groupby("day")["tip"].mean().sort_values(ascending=False)

day
Sun     3.255132
Sat     2.993103
Thur    2.771452
Fri     2.734737
Name: tip, dtype: float64

In [19]:

# %%
df["tip_percentage"] = df["tip"] / df["total_bill"] * 100
df.head()

,total_bill,tip,sex,smoker,day,time,size,tip_pct,tip_percentage
0,16.99,1.01,Female,No,Sun,Dinner,2,5.944673,5.944673
1,10.34,1.66,Male,No,Sun,Dinner,3,16.054159,16.054159
2,21.01,3.50,Male,No,Sun,Dinner,3,16.658734,16.658734
3,23.68,3.31,Male,No,Sun,Dinner,2,13.978041,13.978041
4,24.59,3.61,Female,No,Sun,Dinner,4,14.680765,14.680765

In [20]:
# %%
df["bill_per_person"] = df["total_bill"] / df["size"]
df.head(244)

,total_bill,tip,sex,smoker,day,time,size,tip_pct,tip_percentage,bill_per_person
0,16.99,1.01,Female,No,Sun,Dinner,2,5.944673,5.944673,8.495000
1,10.34,1.66,Male,No,Sun,Dinner,3,16.054159,16.054159,3.446667
2,21.01,3.50,Male,No,Sun,Dinner,3,16.658734,16.658734,7.003333
3,23.68,3.31,Male,No,Sun,Dinner,2,13.978041,13.978041,11.840000
4,24.59,3.61,Female,No,Sun,Dinner,4,14.680765,14.680765,6.147500
...,...,...,...,...,...,...,...,...,...,...
239,29.03,5.92,Male,No,Sat,Dinner,3,20.392697,20.392697,9.676667
240,27.18,2.00,Female,Yes,Sat,Dinner,2,7.358352,7.358352,13.590000
241,22.67,2.00,Male,Yes,Sat,Dinner,2,8.822232,8.822232,11.335000
242,17.82,1.75,Male,No,Sat,Dinner,2,9.820426,9.820426,8.910000
243,18.78,3.00,Female,No,Thur,Dinner,2,15.974441,15.974441,9.390000

In [21]:

# %%
df["bill_per_person"] = df["total_bill"] / df["size"]
df.sample(10)

,total_bill,tip,sex,smoker,day,time,size,tip_pct,tip_percentage,bill_per_person
128,11.38,2.00,Female,No,Thur,Lunch,2,17.574692,17.574692,5.690000
136,10.33,2.00,Female,No,Thur,Lunch,2,19.361084,19.361084,5.165000
42,13.94,3.06,Male,No,Sun,Dinner,2,21.951220,21.951220,6.970000
10,10.27,1.71,Male,No,Sun,Dinner,2,16.650438,16.650438,5.135000
54,25.56,4.34,Male,No,Sun,Dinner,4,16.979656,16.979656,6.390000
155,29.85,5.14,Female,No,Sun,Dinner,5,17.219430,17.219430,5.970000
1,10.34,1.66,Male,No,Sun,Dinner,3,16.054159,16.054159,3.446667
175,32.90,3.11,Male,Yes,Sun,Dinner,2,9.452888,9.452888,16.450000
203,16.40,2.50,Female,Yes,Thur,Lunch,2,15.243902,15.243902,8.200000
49,18.04,3.00,Male,No,Sun,Dinner,2,16.629712,16.629712,9.020000

In [22]:

# %%
df["bill_per_person"] = df["total_bill"] / df["size"]
df.tail(10)

,total_bill,tip,sex,smoker,day,time,size,tip_pct,tip_percentage,bill_per_person
234,15.53,3.00,Male,Yes,Sat,Dinner,2,19.317450,19.317450,7.765000
235,10.07,1.25,Male,No,Sat,Dinner,2,12.413108,12.413108,5.035000
236,12.60,1.00,Male,Yes,Sat,Dinner,2,7.936508,7.936508,6.300000
237,32.83,1.17,Male,Yes,Sat,Dinner,2,3.563814,3.563814,16.415000
238,35.83,4.67,Female,No,Sat,Dinner,3,13.033771,13.033771,11.943333
239,29.03,5.92,Male,No,Sat,Dinner,3,20.392697,20.392697,9.676667
240,27.18,2.00,Female,Yes,Sat,Dinner,2,7.358352,7.358352,13.590000
241,22.67,2.00,Male,Yes,Sat,Dinner,2,8.822232,8.822232,11.335000
242,17.82,1.75,Male,No,Sat,Dinner,2,9.820426,9.820426,8.910000
243,18.78,3.00,Female,No,Thur,Dinner,2,15.974441,15.974441,9.390000

In [23]:

# %%
df.groupby("day")["tip"].mean().sort_values(ascending=False)

day
Sun     3.255132
Sat     2.993103
Thur    2.771452
Fri     2.734737
Name: tip, dtype: float64

In [24]:

# %%
df.groupby("sex")["tip_percentage"].mean().sort_values(ascending=False)

sex
Female    16.649074
Male      15.765055
Name: tip_percentage, dtype: float64

In [25]:

# %%
df.groupby("size")["tip_percentage"].mean().sort_values(ascending=False)

size
1    21.729202
2    16.571919
6    15.622920
3    15.215685
4    14.594901
5    14.149549
Name: tip_percentage, dtype: float64

In [26]:

# %%
df.groupby("time")["tip"].mean().sort_values(ascending=False)

time
Dinner    3.102670
Lunch     2.728088
Name: tip, dtype: float64